extension/src/Catalogs/мкпДействияИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>мкпДействияИнтеграции</Name>
			<Comment>Whitelist экспортных процедур, доступных агенту.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяДействия</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>100</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разрешено</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>50</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

extension/src/CommonModules/мкпДействия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывает действие из whitelist справочника мкпДействияИнтеграции.
//
// Параметры:
//  ТелоJSON - Строка
//  Запрос - HTTPСервисЗапрос
//  Клиент - СправочникСсылка.мкпКлиентыИнтеграции
//
// Возвращаемое значение:
//  Структура
//
Функция ВыполнитьПоТелу(ТелоJSON, Запрос, Клиент) Экспорт

	Если ПустаяСтрока(СокрЛП(Строка(ТелоJSON))) Тогда
		Возврат Ошибка(400, "bad_request", "Некорректный JSON");
	КонецЕсли;
	Попытка
		Данные = мкпСериализация.ИзJSON(ТелоJSON);
	Исключение
		Возврат Ошибка(400, "bad_request", "Некорректный JSON");
	КонецПопытки;
	Имя = Поле(Данные, "name");
	Если Не ЗначениеЗаполнено(Имя) Тогда
		Возврат Ошибка(400, "bad_request", "Нужно имя действия");
	КонецЕсли;
	Элемент = НайтиДействие(Строка(Имя));
	Если Элемент = Неопределено Или Не Элемент.Разрешено Тогда
		Возврат Ошибка(404, "not_found", "Действие " + Имя + " не в whitelist");
	КонецЕсли;
	Если ЗначениеЗаполнено(Элемент.ИмяОбъекта)
		И Не мкпБезопасность.Разрешено(Клиент, Элемент.ВидОбъекта, Элемент.ИмяОбъекта, "write") Тогда
		Возврат Ошибка(403, "forbidden", "Нет доступа на запись");
	КонецЕсли;
	Аргументы = Поле(Данные, "arguments");
	Если Аргументы = Неопределено Тогда
		Аргументы = Новый Соответствие;
	КонецЕсли;
	Возврат Новый Структура("КодСостояния,Тело", 200, Новый Структура("name,accepted,arguments", Строка(Имя), Истина, Аргументы));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиДействие(Имя)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Действия.Ссылка КАК Ссылка,
	|	Действия.Разрешено КАК Разрешено,
	|	Действия.ВидОбъекта КАК ВидОбъекта,
	|	Действия.ИмяОбъекта КАК ИмяОбъекта
	|ИЗ
	|	Справочник.мкпДействияИнтеграции КАК Действия
	|ГДЕ
	|	Действия.ИмяДействия = &Имя
	|	И НЕ Действия.ПометкаУдаления";
	Запрос.УстановитьПараметр("Имя", Имя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция Поле(Данные, Имя)

	Если ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Возврат Данные.Получить(Имя);
	КонецЕсли;
	Если ТипЗнч(Данные) = Тип("Структура") И Данные.Свойство(Имя) Тогда
		Возврат Данные[Имя];
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция Ошибка(КодСостояния, КодОшибки, Подробность)

	Возврат Новый Структура("КодСостояния,КодОшибки,Подробность", КодСостояния, КодОшибки, Подробность);

КонецФункции

#КонецОбласти
